{"id": "ted-connecting-differences", "title": "How to Connect With People Who Are Different Than You", "speaker": "Abigail Spanberger", "date": null, "type": "transcript", "topics": ["communication", "civics", "polarization"], "text": "", "source_url": "https://www.ted.com/talks/abigail_spanberger_how_to_connect_with_people_who_are_different_than_you/transcript", "source_kind": "web_html", "credit": "www.ted.com", "license_note": "Check TED terms for reuse; store excerpts for internal search only."}
{"id": "house-ag-opening-statement", "title": "Opening Statement (House Agriculture Democrats) — Conservation Subcommittee", "speaker": "Abigail Spanberger", "date": null, "type": "prepared_remarks", "topics": ["agriculture", "conservation", "house-hearings"], "text": "Thank you, Chairman Baird. I appreciate the opportunity today to hear from these two witnesses about USDA’s conservation work. And thank you for being here today, Chief Cosby and Administrator Ducheneaux.\nLast month, I convened a Farm Bill Summit in my district to hear directly from Virginia crop and livestock producers, farm groups, and conservation organizations about their priorities as we work to craft and advance the Farm Bill. We had over 100 folks in attendance and heard from a wide range of commodities and perspectives. I would like to thank Administrator Ducheneaux for attending, sharing about FSA’s important work, and listening to Virginia farmers’ questions and feedback firsthand.\nThroughout the day, farmers shared the value of NRCS conservation programs to their operations. Farmers explained that these programs are critical for their ability to fund and start conservation projects on their land and receive payments for protecting land, among other benefits of these programs. Farmers also shared some of the challenges they experienced in enrolling in these programs. One Virginia farmer shared that he spent over a year waiting to enroll in EQIP, due to the program being oversubscribed, and a shortage of Technical Service Providers in the area resulting in a long wait to get a TSP to come out to his operation and develop the plan he needed to enroll.\nIn the last year, we’ve made historic investments in meeting producers’ demand for these programs through additional funding. This is an important step to make sure the funds are there for farmers who want to enroll in these voluntary conservation programs. Now, we need to focus on making it easier for farmers to enroll in these programs.\nAmong the opportunities to strengthen these programs, is the bipartisan bill I co-lead with Chairman Baird, the Increased TSP Access Act, which will help boost the number of TSPs to provide assistance to America’s farmers and ranchers. I want to thank Chairman Baird for his leadership and partnership on this legislation, and I look forward to other opportunities where this Subcommittee can strengthen NRCS conservation programs on a bipartisan basis.\nIn closing, I look forward to learning more about NRCS and FSA’s work, what you are hearing from farmers, and how the Farm Bill can help support your important missions and move conservation forward. These programs are very popular across all regions and commodities, so we must continue to work with partners and leverage resources to help farmers, ranchers, and foresters continue their work as the original conservationists. I yield back.", "source_url": "https://democrats-agriculture.house.gov/news/documentsingle.aspx?DocumentID=2793", "source_kind": "web_html", "credit": "democrats-agriculture.house.gov", "license_note": "US Government works may be public domain; verify site terms."}
{"id": "cspan-virginia-gubernatorial-debate-2025", "title": "Virginia Gubernatorial Debate (C‑SPAN)", "speaker": "Abigail Spanberger (Democratic nominee)", "date": "2025-10-09", "type": "broadcast_event", "topics": ["debate", "governor-2025"], "text": "[INFO] For C-SPAN, export transcript/CC per cspan_export_helper.md, then run cspan_parse.py.", "source_url": "https://www.c-span.org/program/campaign-2026/virginia-gubernatorial-debate/666941", "source_kind": "cspan_program", "credit": "www.c-span.org", "license_note": "Export transcript/CC per C‑SPAN terms; store text internally."}
{"id": "cspan-user-clip-closing-remarks", "title": "Abigail Spanberger — Closing Remarks (User Clip, C‑SPAN)", "speaker": "Abigail Spanberger", "date": null, "type": "clip", "topics": ["debate", "closing-remarks"], "text": "[INFO] For C-SPAN, export transcript/CC per cspan_export_helper.md, then run cspan_parse.py.", "source_url": "https://www.c-span.org/video/?c4755629%2Fabigail-spanberger-closing-remarks=", "source_kind": "cspan_program", "credit": "www.c-span.org", "license_note": "User clip on C‑SPAN; export captions if available."}
{"id": "wtvr-usps-survey-2024", "title": "Hundreds of Virginians still having USPS issues — Spanberger survey (WTVR)", "speaker": "Abigail Spanberger (quoted)", "date": "2024-05-22", "type": "interview_text", "topics": ["usps", "constituent-services"], "text": "RICHMOND, Va. -- Hundreds of Virginians are still having issues with the United States Postal Service, according to results from a survey Representative Abigail Spanberger put out about a month ago.\nThe survey garnered more than 1,800 individual responses, most of them detailing problems with delayed or missing mail.\n\"It really runs the gamut,\" Spanberger said in an interview with CBS 6 Wednesday.\n\"One woman spoke of her husband needing emergency surgery. And while, you know, she thought it was a little bit silly or inconvenient that get-well cards were arriving late, going a distance of 10 miles, and they were going across the state to then come back to her and her home address, that the medication that her husband receives via the mail was itself delayed,\" she said.\nThe survey came after a March audit found the Sandston USPS facility was not prepared to become a regional processing and distribution center, and the change caused delays. The move was part of a national plan to consolidate postal centers in an effort to make mail service more efficient and save USPS money.\n\"From what I've seen, I think that Postmaster General [Louis] DeJoy's plan for consolidation, we haven't yet seen evidence that this has created the efficiencies that he set out to realize,\" Spanberger said. \"I look forward to being wrong long-term if that's the case.\"\nSince the survey came out, USPS's Inspector General's Office released two more audits.\nOne suggests neither the public nor staff, knew about the possible impacts of a \"Local Transporation Optimization Initiative \" happening in Richmond.\nAnother audit suggests USPS continues to have trouble hiring, but disagreed on a recommendation to develop and communicate a plan to attract more pre-career workers.\nThere has been some improvement. According to USPS's OIG , Virginia now has the third worst mail services in the nation, moving up slightly from last place.\n\"It would be reasonable to say there might be some initial hiccups as we implement this new plan, but now we are months into this new plan. And so, in addition to a lack of a lack of communication, I think we've just also seen a lack of planning,\" Spanberger said.\nSpanberger wrote this letter to DeJoy and has not heard back from him at this time.\nCBS6 reached out to USPS for comment on Spanberger's survey and questions detailed in the letter. A spokesperson said USPS responds to elected officials directly.\nUSPS did not respond to our question regarding a potential backup plan, similar to a question posed by Spanberger in her letter, for the Sandston facility. USPS has not responded at this time.\nDepend on CBS 6 News and WTVR.com for in-depth coverage of this important local story. Anyone with more information can email newstips@wtvr.com to send a tip .\nSHARE on social media to SPREAD the WORD!\nEntertainment", "source_url": "https://www.wtvr.com/news/local-news/abigail-spanberger-usps-issues-may-22-2024", "source_kind": "news_html", "credit": "www.wtvr.com", "license_note": "Use excerpts for internal KB; respect outlet terms."}
{"id": "nbc12-vcu-poll-2025", "title": "VCU poll shows narrowing gap in VA races — includes Spanberger (NBC12)", "speaker": "Abigail Spanberger (candidate, referenced)", "date": "2025-09-10", "type": "interview_text", "topics": ["polling", "governor-2025"], "text": "RICHMOND, Va. (WWBT) - With less than two months to go until Election Day, candidate ads are filling TVs and front yards across Central Virginia.\nThere is an all-out effort from both parties to win the governor’s mansion.\nDemocratic candidate for governor Abigail Spanberger continues to lead, but a new poll shows her Republican opponent, Winsome Earle-Sears, closing the gap.\nThat new poll from the L. Douglas Wilder School of Government and Public Affairs at Virginia Commonwealth University shows a narrowing gap between Democrats and Republicans across all of the state races.\nThe Sep. 9th poll states:\n“Among registered voters, former Congresswoman Abigail Spanberger leads Lt. Gov. Winsome Earle-Sears 49% to 40%, down from a 12-point margin last month. Nearly half of independents (48%) remain undecided. For lieutenant governor, Sen. Ghazala Hashmi holds a 45% to 41% edge over John Reid, compared to a 10-point advantage a month ago. Former Del. Jay Jones leads Attorney General Jason Miyares 47% to 41%, narrowing from nine points last month.”\nBut Larry Sabato, political analyst and director of the University of Virginia Center for Politics, warns the polls should be taken with a grain of salt.\n“First of all, the margin of error more than accommodates the change of three points. Statistically, it means nothing,” Sabato said. “What you can draw as a conclusion from the series of polls we’ve seen is that Abigail Spanberger has a sizable, but not insurmountable, lead in the race for governor.”\nSabato said the results on Election Day will be determined primarily by voter turnout, because most people will vote down party lines.\n“The reason we have had ticket elections consistently since 2013 is because we live in a hyper-partisan era, and people have picked a party and they stick with it for the most part. Doesn’t mean that no candidate from the losing party for governor can’t win. It does mean that it’s very difficult,” Sabato said.\nSpanberger and Earle-Sears told 12 On Your Side that they are using the numbers to rally their bases.\n“I notice the media has been trying to really help her by saying, ‘Now this race is where Winsome is down 10 points.’ And that’s a lie and everybody knows that,” Earle-Sears said.\n“We’re making sure that people aren’t taking anything for granted,” Spanberger said. “I’m certainly not taking anything for granted.”\nSabato said that what’s interesting is how both candidates are using this to their advantage.\n“The Republican who’s behind is saying, ‘Look at this. You know darn well, this is inaccurate polling and we have to work even harder to overcome this handicap that’s being imposed on us by the pollsters and the media.’ And what do Democrats say? They say, ‘Don’t you believe these polls. We can’t rely on the polls. We’ve all seen what’s happened in recent elections. Don’t get overconfident.’ So it serves the needs of both parties, and they both use it, and that’s okay,” Sabato said.\nAccording to the latest VCU poll, Virginian voters care most about the rising cost of living, followed by women’s reproductive rights, immigration and education.\n“To the extent that they have picked themes that can get them elected, I think the ads are doing a pretty good job of communicating their messages. In the end, the voters will judge. And again, it’s going to be a question of which party turns out at a higher rate,” Sabato said.\nSabato also said that independent voters probably will not sway the election outcome too much because they tend to be split, as well.\nEarly voting begins next Friday, Sep. 19th.\nIf you plan to vote by mail, you have about a month and a half left to request your ballot.\nTo help you prepare, 12 On Your Side has compiled this voter guide , which includes interviews with candidates for statewide office.\nCopyright 2025 WWBT. All rights reserved.", "source_url": "https://www.nbc12.com/2025/09/10/vcu-poll-shows-narrowing-gap-between-democratic-republican-candidates-va-races/", "source_kind": "news_html", "credit": "www.nbc12.com", "license_note": "Use excerpts for internal KB; respect outlet terms."}
{"id": "youtube-rally-full-speech", "title": "FULL SPEECH: Rally in Virginia (YouTube)", "speaker": "Abigail Spanberger", "date": null, "type": "video_cc", "topics": ["campaign-speech", "rally"], "text": "[WARN] Unable to fetch YouTube captions automatically: No module named 'youtube_transcript_api'", "source_url": "https://www.youtube.com/watch?v=Oda1PqOxLwI", "source_kind": "youtube_cc", "credit": "www.youtube.com", "license_note": "Respect YouTube TOS; use captions for internal reference."}
